
//  написать программу, которая из имеющегося массива строк
// формирует массив из строк, длинна которых меньше либо равна 3 символа.

string[] array = {"1df","2fdf","3fdfd","@"};

int x = array[0].Length;
Console.WriteLine(x);